package com.xidian.yetwish.reading.framework.utils;

/**
 * all constants are define in this class.
 * Created by Yetwish on 2016/4/24 0024.
 */
public class Constant {

    public static final String EXTRA_BOOK = "book";

    public static final String TXT_EXAMPLE = "第二十一回金剪无声云委地宝钗有梦燕依人\n" +
            "\n" +
            "　　不一日，海船到达秦皇岛，弃船登岸，到了北京。\n" +
            "　　韦小宝道：“我要想法子混进皇宫去，可不知哪一天方能得手，大伙儿须得找个安身之所。”当下陆高轩去租了一所住宅，是在宣武门头发胡同，甚是清静，一行人搬了进去。\n" +
            "\n" +
            "　　安顿已毕，韦小宝独自出来，到甜水井胡同天地会的落脚处去一看，见住客已换了个茶叶商，打着会中切口问了几句，那人瞠目不知，显是会中已搬了地址。再踱去天桥，心想八臂猿猴徐天川就算也给逼着入了神龙教，不在天桥，会中其余兄弟高彦超、樊老本等或许可以撞上。哪知在天桥来回踱了几转，竟见不到一个。\n" +
            "\n" +
            "　　当下来到西直门上次来京住饼的客店，取出三两银子，抛在柜上，说要一间上房。掌柜见他出手阔绰，招呼得十分恭敬。韦小宝又取出五钱银子，塞进店小二手里，仍要上次住的那间天字第三号上房，碰巧这房并无住客，店小二算是白赚了五钱银子。韦小宝喝了杯茶，躺在炕上闭目关头养神，听得四下无声，拔出匕首，撬开墙洞，顺治皇帝交给他的那部经书好端端的便在洞里。他打开油布，检视无误，将砖块塞回墙洞。胖头陀已成自己下属，不必再叫待卫来护送经书，于是把经书揣入怀中，径向紫禁城走去。\n" +
            "\n" +
            "　　走到宫外，守门侍卫见一个少年穿着平民服色，直向宫门走来，喝道：“小家伙，干什么的？”韦小宝笑道：“你不认识我么？我是宫里桂公公。”那侍卫向他仔细一看，认了出来，果真是皇上身边的大红人桂公公，忙满脸堆笑，说道：“桂公公，你穿了这身衣服，嘻嘻。”韦小宝笑道：“皇上差我去办一件紧事，赶着回话，来不及换衣服了。”那侍卫道：“是，是。桂公公红光满面，这趟差事定然顺手得很，皇上定有大大赏赐。”\n" +
            "\n" +
            "　　韦小宝回到自己住处，换了太监服色，将经书用块旧布包了，径到上书房来见皇帝。\n";

}
